In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### 透過list建立一個Series

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### 透過一個numpy array 建立DataFrame

In [127]:
##periods數量
dates = pd.date_range('20130101', periods = 6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  1.608715 -0.903238 -1.118550 -0.006048
2013-01-02 -0.824887  0.320807 -0.739519 -0.477532
2013-01-03  0.181872 -0.844190  0.748622  0.284724
2013-01-04 -0.072689 -1.528510  0.827659 -0.412556
2013-01-05 -2.505996 -0.556443  2.512144  0.804913
2013-01-06 -1.572634 -1.199642  0.230451  1.117996

### 通過傳遞一個能夠被轉換成類似序列結構的字典對象來建立一個DataFrame

In [8]:
df2 = pd.DataFrame({"A" : 1.,\
                    "B" : pd.Timestamp('20130102'),\
                    "C" : pd.Series(1, index = list(range(4)), dtype = "float32"),\
                    "D" : np.array([3] * 4, dtype = "int32"),\
                    "E" : pd.Categorical(["test", "train", "test", "train"]),\
                    "F" : "foo"})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### 查看不同列的數據類型

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### 查看DataFrame的頭部和尾部的行

In [11]:
df.head()

                   A         B         C         D
2013-01-01  1.608715 -0.903238 -1.118550 -0.006048
2013-01-02 -0.824887  0.320807 -0.739519 -0.477532
2013-01-03  0.181872 -0.844190  0.748622  0.284724
2013-01-04 -0.072689 -1.528510  0.827659 -0.412556
2013-01-05 -2.505996 -0.556443  2.512144  0.804913

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.072689 -1.528510  0.827659 -0.412556
2013-01-05 -2.505996 -0.556443  2.512144  0.804913
2013-01-06 -1.572634 -1.199642  0.230451  1.117996

### 顯示索引、列和底層的numpy數據

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.values

array([[ 1.6087148 , -0.90323798, -1.11854989, -0.00604834],
       [-0.82488657,  0.32080725, -0.73951908, -0.47753241],
       [ 0.1818721 , -0.84419043,  0.74862242,  0.28472417],
       [-0.07268926, -1.52850963,  0.82765921, -0.41255648],
       [-2.50599599, -0.55644324,  2.51214353,  0.80491278],
       [-1.57263383, -1.19964231,  0.23045056,  1.11799577]])

### describe() 函數對於數據的快速統計匯總

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.530936 -0.785203  0.410134  0.218583
std    1.440041  0.635180  1.296010  0.646602
min   -2.505996 -1.528510 -1.118550 -0.477532
25%   -1.385697 -1.125541 -0.497027 -0.310929
50%   -0.448788 -0.873714  0.489536  0.139338
75%    0.118232 -0.628380  0.807900  0.674866
max    1.608715  0.320807  2.512144  1.117996

### 對數據的轉置

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.608715   -0.824887    0.181872   -0.072689   -2.505996   -1.572634
B   -0.903238    0.320807   -0.844190   -1.528510   -0.556443   -1.199642
C   -1.118550   -0.739519    0.748622    0.827659    2.512144    0.230451
D   -0.006048   -0.477532    0.284724   -0.412556    0.804913    1.117996

### 按軸進行排序

In [18]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01 -0.006048 -1.118550 -0.903238  1.608715
2013-01-02 -0.477532 -0.739519  0.320807 -0.824887
2013-01-03  0.284724  0.748622 -0.844190  0.181872
2013-01-04 -0.412556  0.827659 -1.528510 -0.072689
2013-01-05  0.804913  2.512144 -0.556443 -2.505996
2013-01-06  1.117996  0.230451 -1.199642 -1.572634

### 按值進行排序

In [19]:
df.sort_values(by = "B")

                   A         B         C         D
2013-01-04 -0.072689 -1.528510  0.827659 -0.412556
2013-01-06 -1.572634 -1.199642  0.230451  1.117996
2013-01-01  1.608715 -0.903238 -1.118550 -0.006048
2013-01-03  0.181872 -0.844190  0.748622  0.284724
2013-01-05 -2.505996 -0.556443  2.512144  0.804913
2013-01-02 -0.824887  0.320807 -0.739519 -0.477532

# 選擇

### 獲取
### 選擇一個單獨的列，將會返回Series，等同於df.A

In [20]:
df["A"]

2013-01-01    1.608715
2013-01-02   -0.824887
2013-01-03    0.181872
2013-01-04   -0.072689
2013-01-05   -2.505996
2013-01-06   -1.572634
Freq: D, Name: A, dtype: float64

In [21]:
df.A

2013-01-01    1.608715
2013-01-02   -0.824887
2013-01-03    0.181872
2013-01-04   -0.072689
2013-01-05   -2.505996
2013-01-06   -1.572634
Freq: D, Name: A, dtype: float64

### 通過[ ] 進行選擇，將會對行進行切片

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01  1.608715 -0.903238 -1.118550 -0.006048
2013-01-02 -0.824887  0.320807 -0.739519 -0.477532
2013-01-03  0.181872 -0.844190  0.748622  0.284724

In [23]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.824887  0.320807 -0.739519 -0.477532
2013-01-03  0.181872 -0.844190  0.748622  0.284724
2013-01-04 -0.072689 -1.528510  0.827659 -0.412556

# 通過標籤選擇

### 使用標籤來獲取一個交叉的區域

In [24]:
df.loc[dates[0]]

A    1.608715
B   -0.903238
C   -1.118550
D   -0.006048
Name: 2013-01-01 00:00:00, dtype: float64

### 通過標籤來在多個軸上進行選擇

In [25]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  1.608715 -0.903238
2013-01-02 -0.824887  0.320807
2013-01-03  0.181872 -0.844190
2013-01-04 -0.072689 -1.528510
2013-01-05 -2.505996 -0.556443
2013-01-06 -1.572634 -1.199642

### 標籤切片

In [26]:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02 -0.824887  0.320807
2013-01-03  0.181872 -0.844190
2013-01-04 -0.072689 -1.528510

### 對於返回的對象進行維度縮減

In [27]:
df.loc["20130102", ["A", "B"]]

A   -0.824887
B    0.320807
Name: 2013-01-02 00:00:00, dtype: float64

## 獲取一個標量

In [28]:
df.loc[dates[0], "A"]

1.6087148043249402

### 快速訪問一個標量 等同上

In [29]:
df.at[dates[0], "A"]

1.6087148043249402

# 通過位置選擇

### 通過傳遞數值進行位置選擇(選擇的是行)

In [30]:
df.iloc[3]

A   -0.072689
B   -1.528510
C    0.827659
D   -0.412556
Name: 2013-01-04 00:00:00, dtype: float64

### 通過數值進行切片

In [31]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.072689 -1.528510
2013-01-05 -2.505996 -0.556443

### 通過指定一個位置的列表

In [32]:
df.iloc[[1, 2, 4],[0, 2]]

                   A         C
2013-01-02 -0.824887 -0.739519
2013-01-03  0.181872  0.748622
2013-01-05 -2.505996  2.512144

### 對行進行切片

In [33]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.824887  0.320807 -0.739519 -0.477532
2013-01-03  0.181872 -0.844190  0.748622  0.284724

### 對列進行切片

In [34]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.903238 -1.118550
2013-01-02  0.320807 -0.739519
2013-01-03 -0.844190  0.748622
2013-01-04 -1.528510  0.827659
2013-01-05 -0.556443  2.512144
2013-01-06 -1.199642  0.230451

### 獲取特定的值

In [35]:
df.iloc[1, 1]

0.32080724630382684

In [36]:
df.iat[1, 1]

0.32080724630382684

# Boolean索引

### 使用一個單獨列來選擇數據

In [37]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.608715 -0.903238 -1.118550 -0.006048
2013-01-03  0.181872 -0.844190  0.748622  0.284724

### 使用 where操作來選擇數據

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.608715       NaN       NaN       NaN
2013-01-02       NaN  0.320807       NaN       NaN
2013-01-03  0.181872       NaN  0.748622  0.284724
2013-01-04       NaN       NaN  0.827659       NaN
2013-01-05       NaN       NaN  2.512144  0.804913
2013-01-06       NaN       NaN  0.230451  1.117996

### 使用isin() 方法來過濾

In [39]:
df2 = df.copy()

In [40]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [41]:
df2

                   A         B         C         D      E
2013-01-01  1.608715 -0.903238 -1.118550 -0.006048    one
2013-01-02 -0.824887  0.320807 -0.739519 -0.477532    one
2013-01-03  0.181872 -0.844190  0.748622  0.284724    two
2013-01-04 -0.072689 -1.528510  0.827659 -0.412556  three
2013-01-05 -2.505996 -0.556443  2.512144  0.804913   four
2013-01-06 -1.572634 -1.199642  0.230451  1.117996  three

In [42]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.181872 -0.844190  0.748622  0.284724   two
2013-01-05 -2.505996 -0.556443  2.512144  0.804913  four

# 設置

### 設置一個新的列

In [43]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range("20130102", periods = 6))

In [44]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [45]:
df["F"] = s1

### 通過標籤設置新的值

In [46]:
df.at[dates[0], "A"] = 0

### 通過位置設置新的值

In [47]:
df.iat[0, 1] = 0

### 通過一個numpy數組設置一組新值

In [48]:
df.loc[:, "D"] = np.array([5] * len(df))

In [49]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.118550  5  NaN
2013-01-02 -0.824887  0.320807 -0.739519  5  1.0
2013-01-03  0.181872 -0.844190  0.748622  5  2.0
2013-01-04 -0.072689 -1.528510  0.827659  5  3.0
2013-01-05 -2.505996 -0.556443  2.512144  5  4.0
2013-01-06 -1.572634 -1.199642  0.230451  5  5.0

### 通過where操作來設置新的值

In [50]:
df2 =df.copy()

In [51]:
df2[df2 > 0] = -df2

In [52]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.118550 -5  NaN
2013-01-02 -0.824887 -0.320807 -0.739519 -5 -1.0
2013-01-03 -0.181872 -0.844190 -0.748622 -5 -2.0
2013-01-04 -0.072689 -1.528510 -0.827659 -5 -3.0
2013-01-05 -2.505996 -0.556443 -2.512144 -5 -4.0
2013-01-06 -1.572634 -1.199642 -0.230451 -5 -5.0

# 缺失值處理

### reindex()方法可以對指定軸上的索引進行改變/增加/刪除操作，這將返回原始數據的一個拷貝

In [53]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ["E"])

In [54]:
df1.loc[dates[0]:dates[1], "E"] = 1

In [55]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.118550  5  NaN  1.0
2013-01-02 -0.824887  0.320807 -0.739519  5  1.0  1.0
2013-01-03  0.181872 -0.844190  0.748622  5  2.0  NaN
2013-01-04 -0.072689 -1.528510  0.827659  5  3.0  NaN

### 去掉包函缺失值的行

In [56]:
df1.dropna(how="any")

                   A         B         C  D    F    E
2013-01-02 -0.824887  0.320807 -0.739519  5  1.0  1.0

### 對缺失值進行填充

In [57]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.118550  5  5.0  1.0
2013-01-02 -0.824887  0.320807 -0.739519  5  1.0  1.0
2013-01-03  0.181872 -0.844190  0.748622  5  2.0  5.0
2013-01-04 -0.072689 -1.528510  0.827659  5  3.0  5.0

### 對數據進行Boolean填充

In [58]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# 統計

### 執行描述性統計

In [59]:
df.mean()

A   -0.799056
B   -0.634663
C    0.410134
D    5.000000
F    3.000000
dtype: float64

### 在其他軸上進行相同的操作

In [60]:
df.mean(1)

2013-01-01    0.970363
2013-01-02    0.951280
2013-01-03    1.417261
2013-01-04    1.445292
2013-01-05    1.689941
2013-01-06    1.491635
Freq: D, dtype: float64

### 對於擁有不同維度，需要對齊的對象進行操作。Pandas會自動延著指定的維度進行廣播

In [61]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [62]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [63]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.818128 -1.844190 -0.251378  4.0  1.0
2013-01-04 -3.072689 -4.528510 -2.172341  2.0  0.0
2013-01-05 -7.505996 -5.556443 -2.487856  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# Apply

###  對數據應用函數

In [64]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.118550  5  NaN
2013-01-02 -0.824887  0.320807 -0.739519  5  1.0
2013-01-03  0.181872 -0.844190  0.748622  5  2.0
2013-01-04 -0.072689 -1.528510  0.827659  5  3.0
2013-01-05 -2.505996 -0.556443  2.512144  5  4.0
2013-01-06 -1.572634 -1.199642  0.230451  5  5.0

In [65]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.118550   5   NaN
2013-01-02 -0.824887  0.320807 -1.858069  10   1.0
2013-01-03 -0.643014 -0.523383 -1.109447  15   3.0
2013-01-04 -0.715704 -2.051893 -0.281787  20   6.0
2013-01-05 -3.221700 -2.608336  2.230356  25  10.0
2013-01-06 -4.794334 -3.807978  2.460807  30  15.0

In [66]:
df.apply(lambda x: x.max() - x.min())

A    2.687868
B    1.849317
C    3.630693
D    0.000000
F    4.000000
dtype: float64

# 直方圖

In [67]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [68]:
s

0    0
1    2
2    0
3    5
4    6
5    2
6    0
7    6
8    3
9    0
dtype: int32

In [69]:
s.value_counts()

0    4
6    2
2    2
5    1
3    1
dtype: int64

# 字符串方法

### Series對象在其Str屬性中配備了一組字符串處理方法，可以很容易的應用到數組中的每個元素

In [70]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [71]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# 合併

### Concat

In [72]:
df = pd.DataFrame(np.random.randn(10, 4))

In [73]:
df

          0         1         2         3
0  0.597141 -1.049009  0.208965 -0.542354
1  1.366277  1.582751 -0.015945 -1.080707
2  0.141355 -0.104730 -0.325884 -0.616052
3  0.295541  1.631890  0.313013 -0.254501
4 -0.093873  0.594369 -0.977162  1.016845
5  1.553110  0.389552  0.353506 -0.537240
6  0.161615  0.344131 -0.110807  0.076755
7  1.638961 -0.638500 -0.144288 -0.796646
8  0.192171 -0.505324 -0.403318 -1.528982
9 -0.206461  1.307370  0.008663 -0.594146

In [74]:
pieces = [df[:3], df[3:7], df[7:]]

In [75]:
pieces

[          0         1         2         3
 0  0.597141 -1.049009  0.208965 -0.542354
 1  1.366277  1.582751 -0.015945 -1.080707
 2  0.141355 -0.104730 -0.325884 -0.616052,
           0         1         2         3
 3  0.295541  1.631890  0.313013 -0.254501
 4 -0.093873  0.594369 -0.977162  1.016845
 5  1.553110  0.389552  0.353506 -0.537240
 6  0.161615  0.344131 -0.110807  0.076755,
           0         1         2         3
 7  1.638961 -0.638500 -0.144288 -0.796646
 8  0.192171 -0.505324 -0.403318 -1.528982
 9 -0.206461  1.307370  0.008663 -0.594146]

In [76]:
pd.concat(pieces)

          0         1         2         3
0  0.597141 -1.049009  0.208965 -0.542354
1  1.366277  1.582751 -0.015945 -1.080707
2  0.141355 -0.104730 -0.325884 -0.616052
3  0.295541  1.631890  0.313013 -0.254501
4 -0.093873  0.594369 -0.977162  1.016845
5  1.553110  0.389552  0.353506 -0.537240
6  0.161615  0.344131 -0.110807  0.076755
7  1.638961 -0.638500 -0.144288 -0.796646
8  0.192171 -0.505324 -0.403318 -1.528982
9 -0.206461  1.307370  0.008663 -0.594146

### JOIN

In [77]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [78]:
right = pd.DataFrame({"key": ["foo", "foo"], "lval": [4, 5]})

In [79]:
left

   key  lval
0  foo     1
1  foo     2

In [80]:
right

   key  lval
0  foo     4
1  foo     5

In [81]:
pd.merge(left, right, on = "key")

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

In [82]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})

In [83]:
right = pd.DataFrame({"key": ["foo", "bar"], "lval": [4, 5]})

In [84]:
left

   key  lval
0  foo     1
1  bar     2

In [85]:
right

   key  lval
0  foo     4
1  bar     5

In [86]:
pd.merge(left, right, on="key")

   key  lval_x  lval_y
0  foo       1       4
1  bar       2       5

### Append

In [87]:
df = pd.DataFrame(np.random.randn(8, 4), columns=["A", "B", "C", "D"])

In [88]:
df

          A         B         C         D
0 -0.568815 -1.562117 -0.238309  0.386412
1 -0.615774 -0.088891 -1.031654  0.884493
2 -1.662956 -0.729078  2.386272 -0.181400
3 -2.067010  0.568936  0.009439 -0.075904
4 -0.939443 -0.576360  2.141887 -0.421070
5 -0.630878 -0.555843  0.948687  0.611876
6 -0.792806 -0.021650 -0.466489 -0.824468
7  0.627007 -1.464898  1.215787  1.208120

In [89]:
s = df.iloc[3]

In [90]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.568815 -1.562117 -0.238309  0.386412
1 -0.615774 -0.088891 -1.031654  0.884493
2 -1.662956 -0.729078  2.386272 -0.181400
3 -2.067010  0.568936  0.009439 -0.075904
4 -0.939443 -0.576360  2.141887 -0.421070
5 -0.630878 -0.555843  0.948687  0.611876
6 -0.792806 -0.021650 -0.466489 -0.824468
7  0.627007 -1.464898  1.215787  1.208120
8 -2.067010  0.568936  0.009439 -0.075904

# 分組

### 對於"group by"操作，我們通常是指以下一個或多個操作步驟:

### (Splitting) 按照一些規則將數據分為不同的組
### (Applying)對於每組數據分別執行一個函數
### (Combining) 將結果組合到一個數據結構中

In [91]:
df = pd.DataFrame({"A" : ["foo", "bar", "foo", "bar", 
                          "foo", "bar", "foo", "foo"],
                   "B" : ["one", "one", "two", "three",
                          "two", "two", "one", "three"],
                   "C" : np.random.randn(8),
                   "D" : np.random.randn(8)})

In [92]:
df

     A      B         C         D
0  foo    one  0.697834 -2.203477
1  bar    one -0.275283  1.097184
2  foo    two  1.386763  1.281489
3  bar  three -1.422308 -1.120983
4  foo    two  1.386128  0.783757
5  bar    two  1.002247 -1.329899
6  foo    one  0.477036  0.542494
7  foo  three  0.000688 -1.731950

### 分組並對每個分組執行sum函數

In [93]:
df.groupby("A").sum()

            C         D
A
bar -0.695344 -1.353698
foo  3.948449 -1.327687

# 改變形狀

### Stack

In [94]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [95]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [96]:
index = pd.MultiIndex.from_tuples(tuples, names = ["first", "second"])

In [97]:
df = pd.DataFrame(np.random.randn(8, 2), index = index, columns=["A", "B"])

In [98]:
df2 = df[:4]

In [99]:
df2

                     A         B
first second
bar   one    -1.565945  2.113725
      two    -0.464368 -1.340702
baz   one     0.618681 -0.960974
      two    -0.749297  0.287609

In [100]:
stacked = df2.stack()

In [101]:
stacked

first  second
bar    one     A   -1.565945
               B    2.113725
       two     A   -0.464368
               B   -1.340702
baz    one     A    0.618681
               B   -0.960974
       two     A   -0.749297
               B    0.287609
dtype: float64

In [102]:
stacked.unstack()

                     A         B
first second
bar   one    -1.565945  2.113725
      two    -0.464368 -1.340702
baz   one     0.618681 -0.960974
      two    -0.749297  0.287609

In [103]:
stacked.unstack(1)

second        one       two
first
bar   A -1.565945 -0.464368
      B  2.113725 -1.340702
baz   A  0.618681 -0.749297
      B -0.960974  0.287609

In [104]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.565945  0.618681
       B  2.113725 -0.960974
two    A -0.464368 -0.749297
       B -1.340702  0.287609

# 數據透視表

In [105]:
df = pd.DataFrame({"A" : ["one", "one", "two", "three"] * 3,
                   "B" : ["A", "B", "C"] * 4,
                   "C" : ["foo", "foo", "foo", "bar", "bar", "bar"] *2,
                   "D" : np.random.randn(12),
                   "E" : np.random.randn(12)})

In [106]:
df

        A  B    C         D         E
0     one  A  foo -0.534416 -0.539469
1     one  B  foo -0.134233 -0.176149
2     two  C  foo  0.844696 -1.206688
3   three  A  bar -0.774598 -0.661391
4     one  B  bar  1.432076  0.577274
5     one  C  bar -1.671692  1.802639
6     two  A  foo -0.536968 -1.087884
7   three  B  foo -0.860448  0.593429
8     one  C  foo -0.298522 -1.160724
9     one  A  bar -0.044763 -1.066732
10    two  B  bar -1.699301 -0.390260
11  three  C  bar -0.139678 -0.170802

In [107]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -0.044763 -0.534416
      B  1.432076 -0.134233
      C -1.671692 -0.298522
three A -0.774598       NaN
      B       NaN -0.860448
      C -0.139678       NaN
two   A       NaN -0.536968
      B -1.699301       NaN
      C       NaN  0.844696

# 時間序列

In [136]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

In [137]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [138]:
ts.resample("5Min").sum()

2012-01-01    22292
Freq: 5T, dtype: int32

### 時區表示

In [146]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")

In [147]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [148]:
ts

2012-03-06    1.476007
2012-03-07    1.524726
2012-03-08    0.223723
2012-03-09   -0.490476
2012-03-10    0.721625
Freq: D, dtype: float64

In [149]:
ts_utc = ts.tz_localize("UTC")

In [150]:
ts_utc

2012-03-06 00:00:00+00:00    1.476007
2012-03-07 00:00:00+00:00    1.524726
2012-03-08 00:00:00+00:00    0.223723
2012-03-09 00:00:00+00:00   -0.490476
2012-03-10 00:00:00+00:00    0.721625
Freq: D, dtype: float64

### 時區轉換

In [151]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    1.476007
2012-03-06 19:00:00-05:00    1.524726
2012-03-07 19:00:00-05:00    0.223723
2012-03-08 19:00:00-05:00   -0.490476
2012-03-09 19:00:00-05:00    0.721625
Freq: D, dtype: float64

### 時間跨度轉換

In [152]:
rng = pd.date_range("1/1/2012", periods=5, freq="M")

In [153]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [154]:
ts

2012-01-31    0.016731
2012-02-29    0.320489
2012-03-31   -0.448586
2012-04-30   -1.563761
2012-05-31   -1.614497
Freq: M, dtype: float64

In [155]:
ps = ts.to_period()

In [156]:
ps

2012-01    0.016731
2012-02    0.320489
2012-03   -0.448586
2012-04   -1.563761
2012-05   -1.614497
Freq: M, dtype: float64

In [157]:
ps.to_timestamp()

2012-01-01    0.016731
2012-02-01    0.320489
2012-03-01   -0.448586
2012-04-01   -1.563761
2012-05-01   -1.614497
Freq: MS, dtype: float64

### 時間和時間戳之間的轉換使得可以使用一些方便的算術函數

In [161]:
prng = pd.period_range("1990Q1", "2000Q4", freq="Q-NOV")

In [162]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [164]:
ts.index = (prng.asfreq("M", "e") + 1).asfreq("H", "s") + 9

In [165]:
ts.head()

1990-03-01 09:00   -0.350042
1990-06-01 09:00   -0.050753
1990-09-01 09:00   -2.232684
1990-12-01 09:00   -0.763198
1991-03-01 09:00   -0.876912
Freq: H, dtype: float64

# Categorical

In [166]:
df = pd.DataFrame({"id":[1, 2, 3, 4, 5, 6], "raw_grade":["a", "b", "b", "a", "a", "e"]})

### 將原始的grade 轉換為Categorical數據類型

In [168]:
df["grade"] = df["raw_grade"].astype("category")

In [169]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

### 將Categorical類型數據重命名

In [171]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

### 對類別進行重新排序,增加缺失的類別

In [173]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [174]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

### 排序是按照Categorical的順序進行的而不是按照字典順序

In [175]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good